#encoding=utf-8

list = ['三叉神经痛', '脑梗塞', '脑中风', '脑血栓', '头痛头晕', '脑出血',
        '脑供血不足', '高血压脑病', '脑萎缩', '偏瘫', '脑血管痉挛', '失眠',
        '脑缺血', '小脑萎缩', '偏头痛', '抽动症', '中风', '遗 尿', '口吃',
        '癫痫', '脑瘫', '多动症', '脑膜炎', '矮小症', '颅脑损伤后头', '近视',
        '远视', '沙眼', '红眼病', '视网膜病', '斜视', '白内障', '青光眼',
        '结膜炎', '角膜炎', '散光', '干眼症', ' 黄斑变性', '色盲', '眼胞浮肿',
        '鼻炎', '鼻窦炎', '鼻息肉', '打呼噜', '过敏性鼻炎', '酒渣鼻', '鼻咽炎',
        '带血粘脓鼻涕', '耳聋', '耳鸣', '外耳炎', '中耳炎', '外耳道异物', '耳鸣如潮',
        '面瘫', '黄褐斑', '面部浮肿', '面部麻木', '口腔溃疡', '口腔粘膜病', '牙周病',
        '口腔糜烂', '咽喉炎', '扁桃体炎', '慢性咽炎', '猩红热', '扁桃体周围脓', '咽喉干燥充血',
        '扁桃体周围脓', '甲亢', '甲状腺炎', '甲状腺癌', '甲减', '甲状腺肿大', '气管炎', '支气管炎',
        '气管梗阻', '呼吸困难', '乳腺癌', '乳腺炎', '乳房湿疹', '乳腺囊性增生', '乳房肿块', '百日咳',
        '哮喘', '小儿肺炎', '肺癌', '肺火', '肺部感染', '心力衰竭', '风湿性心脏病', '冠心病', '心肌炎',
        '心脏肥大', '食道癌', '食管炎', '食管破裂', '食管异物', '膈疝', '膈肌麻痹', '呃逆症', '膈肌肿瘤',
        '膈肌缺损', '纵隔炎', '纵隔疝', '胸腺囊肿', '纵隔脓肿', '纵膈气肿', '慢性胃炎', '胃溃疡', '胃癌',
        '胃窦炎', '反胃', '胃疼', '疝气', '肠梗阻', '肠胃炎', '便秘', '直肠癌', '肠坏死', '甲肝', '乙肝',
        '丙肝', '肝硬化', '脂 肪肝', '小三阳', '大三阳', '肝癌', '肝火', '肝功能不全', '阑尾炎', '盲肠肉芽肿',
        '小儿急性阑尾', '阑尾肿瘤', '阑尾穿孔', '胰腺炎', '糖尿病', '胰腺癌', '胰腺囊肿', '胰石阻塞', '脾破裂',
        '脾 功能亢进', '湿热蕴脾', '脾囊肿', '脾肿大', '胆囊炎', '胆囊息肉', '胆囊癌', '胆汁泛溢', '腹膜炎', '腹膜肿瘤',
        '结核性腹膜炎', '肠系膜肿瘤', '网膜炎', '肠系膜淋巴结', '尿毒症', '肾炎', '肾功 能衰竭', '肾结石', 'IGA肾病',
        '肾小球肾炎', '肾结核', '肾积水', '慢性肾炎', '肾盂积水', '肾上腺危象', '肾上腺素中毒', '肾上腺髓质增', '肾上腺皮质激',
        '肾上腺中毒', '输尿管炎', '输尿管结石', '血尿', '小儿尿路感染', '输尿管疼痛', '前列腺炎', '前列腺增生', '前列腺结石',
        '前列腺癌', '睾丸炎', '死精症', '睾丸损伤', '隐睾', '睾丸胀痛', '睾丸癌', '阳痿', '早泄', '包茎', '男性不育', '勃起功能障碍',
        '包皮龟头炎', '包皮过长', '阴茎短小', '龟头炎', '小阴茎', '阴茎短', '输精管堵塞', '输精管缺如', '输精管疼痛', '阴囊炎', '阴囊癌',
        '阴囊湿疹', '鞘膜积液', '阴囊瘙痒', '卵巢囊肿', '不排卵', '宫外孕', '卵巢破裂', '卵巢癌', '卵巢炎', '宫颈炎', '宫颈糜烂', '月经不调',
        '子宫内膜炎', '子宫肿瘤', '流产', '宫颈癌', '子宫肌瘤', '痛经', '盆腔炎', '附件炎', '不孕症', '输 卵管不通', '输卵管性不孕', '输卵管积水',
        '输卵管炎', '输卵管堵塞', '阴道炎', '白带异常', '阴道痉挛', '滴虫性阴道炎', '处女膜闭锁', '阴道分泌物增多', '外阴湿疹', '外阴溃疡', '外阴瘙痒',
        '外 阴炎', '手足口病', '梅毒', '淋病', '艾滋病', '疥疮', '阴虱', '软下疳', '尖锐湿疣', '生殖器疱疹', '白癜风', '牛皮癣', '荨麻疹', '鱼鳞病',
        '脱发', '腋臭', '斑秃', '白发症', '扁平疣', '疥疮', '湿疹', '皮炎', '白化病', '皮肤瘙痒', '皮肤干燥', '淋巴瘤', '淋巴癌', '颈淋巴结炎',
        '淋巴管炎', '局部淋巴结肿', '血友病', '地中海贫血', '主动脉瘤', '动脉硬化', '血管硬化', '红斑狼疮', '类风湿性关节', '结缔组织病', '干燥综合征',
        '免疫力下降', '重症肌无力', '多发性肌炎', '周期性麻痹', '肌张力异常', '肌肉痉挛', '三叉神经痛', '雷诺病', '周围神经损伤', '周围神经损害',
        '肩周炎', ' 肩袖损伤', '肩-手综合征', '肩胛骨酸痛', '臂丛神经损伤', '肱动脉损伤', '伊藤痣', '网球肘', '肘外翻', '肘关节强直', '肘关节结核',
        '关节肿痛', '尺管综合征', '桡管综合征', '旋前圆肌综合', '前臂旋转痛', '灰指甲', '甲沟炎', '腱鞘炎', '脆甲症', '股骨头坏死', '下肢静脉曲张',
        '拇外翻', '膝关节结核', '下肢浮肿', '腿脚浮肿', '坐骨神经损伤', '坐骨神经痛', '股动脉损伤', '股动脉瘤', '大腿 刺痛', '胫腓骨骨折', '淤滞性紫癜',
        '小腿动脉损伤', '小腿酸痛', '膝关节结核', '十字韧带损伤', '半月板损伤', '髌腱断裂', '膝盖长骨刺', '手足藓', '灰指甲', '甲沟炎', '扁平足', '脚气',
        '糖尿病 足', '手足癣', '足跟淤血', '膀胱炎', '膀胱癌', '膀胱结石', '膀胱湿热', '膀胱残余尿量增多', '尿失禁', '输尿管结石', '血尿', '尿道炎',
        '非淋性尿道炎', '尿路感染', '尿道损伤', '尿道口痒', '尿 道结石', '会阴疝', '会阴裂伤', '会阴下降综合', '会阴溃疡', '股癣', '坐骨神经痛',
        '坐板疮', '臀部酸痛', '便秘', '肛裂', '肛瘘', '痔疮', '内痔', '外痔', '混合痔', '肛管炎', '脱肛', '直肠炎', '肛周炎', '肛门坠胀', '骨髓炎',
        '老年急性白血病', '髓内肿瘤', '骨髓抑制', '肩部骨折', '肱骨骨折', '桡骨骨折', '孟氏骨折', '曲棍球棒手', '股骨头坏死', '股骨骨折', '距骨骨折',
        '踝部骨折', '髌后捻发音', '踝关节脱位', '骨关节炎', '肩关节脱位', '肘关节脱位', '关节响痛', '强直性脊柱炎', '颈椎病', '骨质增生', '腰椎间盘突出',
        '脊柱炎', '脊柱侧弯', '脊柱侧凸', '颅骨骨瘤', '颅骨结核', '颅骨缺损', '颅骨增生', '肋骨骨髓炎', '肋软骨炎', '鸡胸', '肋骨痛', '骨盆骨折', '骶骨骨折',
        '尾痛症', '骨盆痛', '急性脊髓炎', '脊髓压迫症', '脊髓小脑变性', '脊髓病变', '锁骨骨折',
        '颧骨骨折', '胸骨裂', '眼眶骨折', '骨无菌性坏死', '失眠症', '焦虑症', '自闭症', '强迫症', '心理性性功能']
for i in list:
    with open("./Disease.csv",'a+',encoding='utf-8') as f :
        f.write(i)
        f.write("\n")




