# -*- coding: utf-8 -*-
import scrapy
from  scrapy import Request
from copy import deepcopy
import csv


class ExampleSpider(scrapy.Spider):
    name = 'jieba_try'
    allowed_domains = ['baike.baidu.com']
    start_urls = []

    def start_requests(self):
        item = {}
        list = ['粥', '疲劳综合','韭菜', '葡萄', '芝麻油', '粳米','芝麻','番木瓜','大茴香','绿豆','猪蹄','豆腐','花椒','黄豆','银耳','石榴','胡椒','蚕豆','猪骨髓','番茄','橘','辣椒','豌豆','狗肉','土豆','金橘','红豆','羊肉','香菇','橙','白豆','牛肉','白菜','柑','西米','牛百叶','萝卜','柚','谷芽','驴肉','胡萝卜','香橼','燕麦','兔肉','苋菜','枇杷','糯米','猪皮','茼蒿','梅子','茶油','红薯','鸡肉','芹菜','山楂','南瓜','鸡蛋','扁豆','杨梅','玉米','鹅肉','刀豆','樱桃','鸭肉','薤白','银杏','鹧鸪肉','大头菜','核桃','鸽子肉','荠菜','榛子','莴笋','荔枝','鹌鹑肉','黄花菜','桑葚','白糖','鲤鱼','马兰','开心果','豆豉','鲢鱼','海带','枸杞','小米','火腿','豇豆','杏','豆油','鳙鱼','紫菜','哈密瓜','草鱼','发菜','龙眼','青鱼','苔菜','橄榄','鯔鱼','木耳','榧','白鱼','茭白','槟榔','黄鱼','茄','枳椇','鲳鱼','葫芦','无花果','鲥鱼','冬瓜','花生','鲚鱼','丝瓜','西瓜','鲈鱼','苦瓜','甜瓜','高粱','猪脑','山药','桃','菜油','鲫鱼','菜瓜','莲子','鳊鱼','黄瓜','芡实','鳜鱼','芋头','菱角','银鱼','荸荠','黑鱼','韭黄','慈姑','墨鱼','豆芽','甘蔗','比目鱼','金针菇','杏仁','鲇鱼','平菇','葵瓜子','黄刺鱼','洋葱','西瓜子','带鱼','百合','松子','小麦','猪肺','竹笋','李子','盐','田鸡','鲜枣','鳗鲡','鳝鱼','泥鳅','甲鱼','龟肉','虾','蟹','牡蛎','蚌','荞麦','猪心','包菜','苹果','醋','蛤蜊','淡菜','田螺','干贝','燕窝','蛇肉','海参','阿胶','牛奶','羊奶','薏米','猪肝','芥菜','栗','酱油','蚕蛹','黑豆','猪肾','菠菜','干枣','芥末','大麦','猪肚子','菜花','梨','小茴香','猪肉','乌鸡','番石榴','杨桃','橘子','火龙果','柚子','西红柿','黑米','莜麦','红小豆','板栗','黑芝麻','红茶','绿茶','橄榄油','花粉','冰激凌','咖啡','冰镇饮料','烧烤','饼干','方便面','油条','白萝卜','柠檬','生菜','紫甘蓝','香蕉','红枣','桑椹','菠萝','茄子','青梅','橙子','草莓','椰子','豆浆','冰糖','西葫芦','莲藕','卷心菜','鹌鹑','蛋糕','面包','月饼','油饼','薯片','蜜饯','绿豆芽','桂圆','松花蛋','酸枣仁','鸡蛋黄','猪油','黄油','可乐','啤酒','年糕','葱','生姜','蒜','菊花','罗布麻','蜂蜜','瘦肉','食醋','鸡蛋清','腐乳','烟','腌制品','浓茶','碳酸饮料','油炸食品','西兰花','蒜苗','茴香','芒果','金针菜','黄鳝','酸奶','腰果','罐头','葡萄干','桃干','猴头菇','豆芽菜','雪里蕻','三文鱼','黑枣','包心菜','藕粉','淀粉','粉丝','四季豆','挂面','鳕鱼','肉松','坚果','豆制品','胡桃','豆粉','糙米','佛手柑','甜点心','乌梅','酒','酸菜','巧克力','甜菜','油菜','榴莲','香菜','腌制蔬菜','柿子','香椿','空心菜','杏干','萝卜缨','苤蓝','山竹','紫苏叶','酸枣','醪糟','可可','酱','菜子油','秫米','麦芽','葵花籽','乳酪','原醋','糖果','玉米粥','面条','粗粮','煎饼','薏米粥','汉堡','冷饮','植物油','沙拉','动物油','黄米','鹌鹑蛋','饴糖','荷叶','薄荷','肉桂','丁香','豆蔻','金银花','鸭蛋','西洋参','奶制品','粟米','薏苡仁','茯苓','枸杞叶','花旗参','麻辣火锅','红参','土茯苓','砂糖','红糖','羊油','陈皮','黄酒','玫瑰花','葡萄酒','鸡内金','焦山楂','焦神曲','橘皮','柠檬茶','泡菜','玉米油','砂仁','奶酪','高梁','冰水','车前子','麦冬','沙丁鱼','枸杞子','姜片','肥猪肉','蟹黄','鱼子','猕猴桃','海蜇','虾皮','蛋清','肥肉','鹅肝','猪肚','腊肉','香肠','炸鸡','鸡皮','咸鸭蛋','熏肉','螃蟹','麻花','皮蛋','蛋黄','烟酒','木瓜','旱芹','莼菜','动物肝脏','白芷','葱白','奶油','腌制食品','加工肉食品','浓咖啡','赤小豆','大米','冬笋','桂花','核桃仁','姜','秋葵','黄芩','花茶','地骨皮','饮料','蛤','大枣','大葱','鲜三七','黄连','栀子','胆草','蘑菇','白术','天麻','厚朴','半夏','党参','杜仲','当归','猪排骨','黄芪','芍药','葛根','炒枳实','女贞子','熟地黄','生杷叶','茵陈','生地黄','决明子','石斛','西瓜汁','炒黄芩','天冬','蒜米','小朝天椒','魔芋','黄精','西芹','猪里脊','红椒','青椒','葱花','朝天椒','沙参','枣干','龙眼肉','北沙参','老姜','玉竹','枣','圆椒','大蒜','米饭','火腿肠','面粉','干酵母','麦淀粉','蜜枣','芡实米','猪瘦肉','何首乌','玉米须','茯苓粉','高筋粉','奶粉','全麦粉','白芝麻','口蘑','芸豆','蚌肉','干辣椒','猪展肉','老鸽','菠菜根','青菜心','虫草','玉米面','黑芝麻粉','糯米粉','糖桂花','白砂糖','西瓜皮','排骨','酵母','水','紫薯','葱姜','白果','荜茇','人参','杞子','山萸肉','熟地','黑荆芥','山药粉','芽根','红薯粉','瘦肉面粉','小白菜','野山椒','小麦粉','香叶','白茅根','番茄酱','红辣椒','柏子仁','淮山','北芪','米酒','鹿茸','茶叶','丘比沙拉汁（焙煎芝麻口味）','千禧','苦菊','丘比沙拉汁（青柠口味）','温开水','藕','清水','冬瓜皮','黄瓜皮','鸡肠','葫芦瓜','甘草','柿饼','罗汉果','淡豆豉','蒸面饼','小蓟草','白菜叶','银杏仁','白菜干','苦杏仁','鲜百合','内酯豆腐','葱姜末','百部','银花','藿香','炸花生米','龙须面','青菜','四季青','雪梨','鲜竹沥','芦根','川贝','虾米','料酒','江米','山楂糕','鱼胶粉','熟栗子','薏仁米','乌龙茶','冬瓜仁','干荷叶','病变','排骨酱','面豉酱','母鸡','荔枝干','童子鸡','圆糯米','栗子','猪肉丁','杏鲍菇','蒜苔','笋','小米辣','小木耳','荷兰豆','小红尖椒','姜末','马蹄','小青尖椒','大姜','红米','眉豆','姜葱蒜','芽菜','鸽肉','冬虫夏草','乌骨鸡','豆干','雏鸽','干红椒','干桂花','灯芯草','虾仁','干桂圆','葫芦壳','鸽蛋','肉苁蓉','海马','白米虾','菟丝子','肉末','胡椒粉','羊肾','胡桃仁','麻油','巴戟','猪扇骨','蒲公英','花生仁','猪腰','草菇','老雄鸭','鸡','鸡脯肉','干香菇','鸡胸肉','嫩姜','薏仁','鸡胸','猪小排','猪骨','银耳(干)','大豆','觅菜','腐竹','紫苏','野菊花','仔鸡','糖','枇杷果','枇杷叶','苡仁','香菜末','香菜梗','甘菊','毛豆','葱段','田七','豆瓣酱','瘦肉碎','糖粉','低筋面粉','全脂奶粉','麦芽糖','细砂糖','川穹','桃仁','红花','猪脚','川芎','粉光参','蒜瓣','熟五香花生','鱼露','鱼仔','花胶','玫瑰糖','肉馅','大红豆','小红豆','籼米粉','鲜荷叶','笋干','热炒仙露','腊肠','咖喱','青豌豆','白米饭','青瓜','桂元肉','雪耳','饺子皮','淮米','桂圆肉','河虾','尖椒','茉莉花','老鸭','干橘皮','天门冬','香椿芽','海带丝','高筋面粉','栀子花','寸冬','油','香附','干茉莉花','瘦猪肉','柴胡','里脊肉片','黑木耳','鸡肝','鲜薄荷','棒渣','子母鸡','龟板胶','莲子心','粉条','甘蓝','桂元','柠檬汁','甜菊','玫瑰花瓣','白鹅','淮山药','首乌藤','圆葱','牛腩','黄冰糖','知母','紫米','生黄芪','防风','吉利片','淡奶油','桑葚酒','白芍','金桔饼','瑶柱','金钱草','天花粉','玫瑰','白兰地','青木瓜','车前叶','马蹄粉','赤豆','鱼腩','鸭肫','猪腱','板蓝根','椒盐','油豆腐','鸭子','鸡骨草','白扁豆','泡辣椒','泡青菜','泡姜','花生米','芦笋','桔皮','鸭血','桂皮','沙茶酱','金桔','桃胶','雪莲子','里脊肉','怀山药','松子仁','南瓜子','羊腰','鱼头','玉米粉','糯米饭','丹参粉','三七','干玫瑰花','玉米粒','高良姜','草果','青木香','柚子皮','月季花','竹茹','炒麦芽','山楂片','乳鸽','菜胆','橘络','五味子','椰浆','竹荪(干)','味精','八角','玫瑰花酱','中筋面粉','油酥部分','油皮部分','老母鸡','生粉','小母鸡','桂枝','羊排','桑枝','鸽子','羊脑','鸡血藤','牛蹄筋','茅根','老桑枝','嫩豆腐','黄豆芽','松仁','白玉菇','豆皮','彩椒','海苔','豆角','青豆','马齿苋','梳毛肚','鸭肉块','黄豆酱','茶树菇','鸭腿','圣女果','裙带菜','鸭掌','燕麦片','猪大骨','荞麦面','高粱米','甘薯','菜心','鲜香菇','牛蒡','泡椒','牛肚','牛腱','豆腐皮','香干','牛舌','牛心','蒜薹','鸭胗','鸭肝','大白菜','鸭肠','酸豆角','鸡汤','白菜芯','酸笋','小葱','熟皮蛋','高汤','熟肥肠','豆腐干','白芸豆','花芸豆','红芸豆','黑芸豆','西蓝花','红彩椒','黄彩椒','青蒜苗','猪脊骨','上海青','鱼丸']
        # file = open("H:\\pycharmproject\\project\\baidubaike\\baidubaike\\spiders\\jtys.csv","rt")
        # item = {}
        # read = csv.reader(file)
        for li in list:
        #     item['name'] = li
        #     # li = line[0]
        #     # item["title"] = li
            item["name"] = li
            url = "http://baike.baidu.com/item/" + li
            yield Request(url, callback=self.parse, dont_filter=True, meta={"item":deepcopy(item)})


    def parse(self, response):
        item = response.meta["item"]
        # print(response.body.decode())
        content_list = response.xpath("//div[@class='lemma-summary']/div[@class='para']")
        text_s = ""  # 简介
        for div in content_list:
            text_raw = div.xpath(".//text()").extract()
            text = str(text_raw).replace("['", "").replace("']", "").replace(" ",
            "").replace("','", "")
            text_s += text + "\n"
        item["disease"] = text_s

        # 小内容
        dd_s = "{"
        dt_list = response.xpath("//div[@class='basic-info cmn-clearfix']/dl/dt")
        for dt in dt_list:
            dd = dt.xpath("./following-sibling::dd[1]")
            dt_text_raw = dt.xpath("./text()").extract()
            dd_text_raw = dd.xpath(".//text()").extract()

            dt_text = str(dt_text_raw).replace("['", "").replace("']", "").replace(" ",
            "").replace("\\xa0", "")


            dd_text = str(dd_text_raw).replace("['", "").replace("']", "").replace(" ",
            "").replace("\\xa0", "").replace("\\n","").replace("','", "").replace("、",
            "，").replace(",", "，")
            ones = "'" + dt_text + "'" + ":" + "'" + dd_text + "'" + ","
            dd_s += ones
        # print(dd_s[0:-1])
        if len(dd_s) > 3:
            dd_fin = dd_s[0:-1] + "}"
            print(dd_fin)
            item["clearfix"] = dd_fin
        else:
            item["clearfix"] = ""
        yield item










        # item = response.meta["item"]
        # # try:
        # disease = ""
        # disease_list = response.xpath("//div[@class='para']")
        #
        # for disease_s in disease_list:
        #     disease_raw = disease_s.xpath(".//text()").extract()
        #     # print(disease_raw)
        #
        #     if len(disease_raw) >0:
        #         disease_s_raw = str(disease_raw).replace("']","").replace("['","").replace(" ","").replace("','","").replace("、、",
        #         "").replace("\\u3000","").replace("\\r","").replace("\\n","").replace("\\t","").replace("\n",
        #         "").replace("\xa0","").replace("\r","")
        #         disease_s_s_raw = disease_s_raw +"\n"
        #         disease = disease + disease_s_s_raw
        #
        # # print(disease)
        # item["disease"] = disease
        #
        # yield item
        # # print(item)
